In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
columns = ['w','x','y','z']

In [4]:
index = ['A','B','C','D', 'E']

In [5]:
from numpy.random import randint

In [6]:
np.random.seed(42)
data = randint(-100,100,(5,4))

In [7]:
data

array([[  2,  79,  -8, -86],
       [  6, -29,  88, -80],
       [  2,  21, -26, -13],
       [ 16,  -1,   3,  51],
       [ 30,  49, -48, -99]])

In [8]:
df = pd.DataFrame(data, index, columns)

In [9]:
df

    w   x   y   z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [10]:
df['w']

A     2
B     6
C     2
D    16
E    30
Name: w, dtype: int32

In [11]:
type(df['w'])

pandas.core.series.Series

In [12]:
df[['w',  'z']]

    w   z
A   2 -86
B   6 -80
C   2 -13
D  16  51
E  30 -99

In [13]:
df['new'] = df['w'] + df['y']

In [14]:
df

    w   x   y   z  new
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19
E  30  49 -48 -99  -18

In [15]:
df.drop('new', axis=1)

    w   x   y   z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [16]:
df.loc['A']

w       2
x      79
y      -8
z     -86
new    -6
Name: A, dtype: int32

In [17]:
df.loc[['A','B']]

   w   x   y   z  new
A  2  79  -8 -86   -6
B  6 -29  88 -80   94

In [18]:
df.iloc[-1]

w      30
x      49
y     -48
z     -99
new   -18
Name: E, dtype: int32

In [19]:
df.iloc[0:1]

   w   x  y   z  new
A  2  79 -8 -86   -6

In [20]:
df.iloc[1:3]

   w   x   y   z  new
B  6 -29  88 -80   94
C  2  21 -26 -13  -24

In [23]:
df.loc[['A','C'],['w','y']]

   w   y
A  2  -8
C  2 -26

In [26]:
df[df > 0]

    w     x     y     z   new
A   2  79.0   NaN   NaN   NaN
B   6   NaN  88.0   NaN  94.0
C   2  21.0   NaN   NaN   NaN
D  16   NaN   3.0  51.0  19.0
E  30  49.0   NaN   NaN   NaN

In [27]:
df['x']>0

A     True
B    False
C     True
D    False
E     True
Name: x, dtype: bool

In [32]:
df[df['x'] > 0]['w'].iloc[0:]

A     2
C     2
E    30
Name: w, dtype: int32

In [33]:
df[(df['w']>0) | (df['y']>1)]

    w   x   y   z  new
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19
E  30  49 -48 -99  -18

In [34]:
df[(df['w']>0) & (df['y']>1)]

    w   x   y   z  new
B   6 -29  88 -80   94
D  16  -1   3  51   19

In [36]:
df.reset_index()

  index   w   x   y   z  new
0     A   2  79  -8 -86   -6
1     B   6 -29  88 -80   94
2     C   2  21 -26 -13  -24
3     D  16  -1   3  51   19
4     E  30  49 -48 -99  -18

In [37]:
df

    w   x   y   z  new
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19
E  30  49 -48 -99  -18

In [38]:
new_ind = ['CA', 'NY', 'WY', 'OR','CO']

In [39]:
df['States'] = new_ind

In [40]:
df

    w   x   y   z  new States
A   2  79  -8 -86   -6     CA
B   6 -29  88 -80   94     NY
C   2  21 -26 -13  -24     WY
D  16  -1   3  51   19     OR
E  30  49 -48 -99  -18     CO

In [42]:
df.set_index('States')

         w   x   y   z  new
States
CA       2  79  -8 -86   -6
NY       6 -29  88 -80   94
WY       2  21 -26 -13  -24
OR      16  -1   3  51   19
CO      30  49 -48 -99  -18

In [43]:
df.describe()

              w          x          y          z        new
count   5.00000   5.000000   5.000000   5.000000   5.000000
mean   11.20000  23.800000   1.800000 -45.400000  13.000000
std    11.96662  42.109381  51.915316  63.366395  48.187135
min     2.00000 -29.000000 -48.000000 -99.000000 -24.000000
25%     2.00000  -1.000000 -26.000000 -86.000000 -18.000000
50%     6.00000  21.000000  -8.000000 -80.000000  -6.000000
75%    16.00000  49.000000   3.000000 -13.000000  19.000000
max    30.00000  79.000000  88.000000  51.000000  94.000000

In [44]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to E
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   w       5 non-null      int32
 1   x       5 non-null      int32
 2   y       5 non-null      int32
 3   z       5 non-null      int32
 4   new     5 non-null      int32
 5   States  5 non-null      object
dtypes: int32(5), object(1)
memory usage: 340.0+ bytes